Masmiseim36/nxpSDK/devices/MKW39A4/drivers/fsl_dspi.c
    while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoFillRequestFlag))
    {
        DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
    }

    base->PUSHR = data;

    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);

    /* Wait till TCF sets */
    while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxCompleteFlag))
    {
    }
}

/*!
 * brief Writes data into the data buffer in slave mode, waits till data was transmitted, and returns.
 *
 * In slave mode, up to 16-bit words may be written. The function first clears the transmit complete flag, writes data
 * into data register, and finally waits until the data is transmitted.
 *
 * param base DSPI peripheral address.
 * param data The data to send.
 */
void DSPI_SlaveWriteDataBlocking(SPI_Type *base, uint32_t data)
{
    /* First, clear Transmit Complete Flag (TCF) */
    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxCompleteFlag);

    while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoFillRequestFlag))
    {
        DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
    }

    base->PUSHR_SLAVE = data;

    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);

    /* Wait till TCF sets */
    while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxCompleteFlag))
    {
    }
}

/*!
 * brief Enables the DSPI interrupts.
 *
 * This function configures the various interrupt masks of the DSPI.  The parameters are a base and an interrupt mask.
 * Note, for Tx Fill and Rx FIFO drain requests, enable the interrupt request and disable the DMA request.
 *       Do not use this API(write to RSER register) while DSPI is in running state.
 *
 * code
 *  DSPI_EnableInterrupts(base, kDSPI_TxCompleteInterruptEnable | kDSPI_EndOfQueueInterruptEnable );
 * endcode
 *
 * param base DSPI peripheral address.
 * param mask The interrupt mask; use the enum _dspi_interrupt_enable.
 */
void DSPI_EnableInterrupts(SPI_Type *base, uint32_t mask)
{
    if (0U != (mask & SPI_RSER_TFFF_RE_MASK))
    {
        base->RSER &= ~SPI_RSER_TFFF_DIRS_MASK;
    }
    if (0U != (mask & SPI_RSER_RFDF_RE_MASK))
    {
        base->RSER &= ~SPI_RSER_RFDF_DIRS_MASK;
    }
    base->RSER |= mask;
}

/*Transactional APIs -- Master*/

/*!
 * brief Initializes the DSPI master handle.
 *
 * This function initializes the DSPI handle, which can be used for other DSPI transactional APIs.  Usually, for a
 * specified DSPI instance,  call this API once to get the initialized handle.
 *
 * param base DSPI peripheral base address.
 * param handle DSPI handle pointer to dspi_master_handle_t.
 * param callback DSPI callback.
 * param userData Callback function parameter.
 */
void DSPI_MasterTransferCreateHandle(SPI_Type *base,
                                     dspi_master_handle_t *handle,
                                     dspi_master_transfer_callback_t callback,
                                     void *userData)
{
    assert(NULL != handle);

    /* Zero the handle. */
    (void)memset(handle, 0, sizeof(*handle));

    g_dspiHandle[DSPI_GetInstance(base)] = handle;

    handle->callback = callback;
    handle->userData = userData;
}

static void DSPI_MasterHandleTransferByte(SPI_Type *base, dspi_master_handle_t *handle)
{
    uint8_t dummyData                = DSPI_GetDummyDataInstance(base);
    uint8_t *txData                  = handle->txData;
    uint8_t *rxData                  = handle->rxData;
    size_t remainingReceiveByteCount = handle->remainingReceiveByteCount;
    size_t remainingSendByteCount    = handle->remainingSendByteCount;

    uint32_t currentCmd  = handle->command;
    uint32_t currentSize = handle->fifoSize;
    while (remainingSendByteCount > 0U)
    {
        if (remainingSendByteCount == 1U)
        {
            currentCmd  = handle->lastCommand;
            currentSize = 0U;
        }
        /*Wait until Tx Fifo is not full*/
        while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoFillRequestFlag))
        {
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
        }
        if (txData != NULL)
        {
            base->PUSHR = currentCmd | (uint16_t)(*txData);
            txData++;
        }
        else
        {
            base->PUSHR = currentCmd | dummyData;
        }
        DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
        remainingSendByteCount--;

        while ((remainingReceiveByteCount - remainingSendByteCount) > currentSize)
        {
            if (0U != (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_RxFifoDrainRequestFlag))
            {
                if (rxData != NULL)
                {
                    *(rxData) = (uint8_t)DSPI_ReadData(base);
                    rxData++;
                }
                else
                {
                    (void)DSPI_ReadData(base);
                }
                remainingReceiveByteCount--;

                DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_RxFifoDrainRequestFlag);
            }
        }
    }
}

static void DSPI_MasterHandleTransferHalfword(SPI_Type *base, dspi_master_handle_t *handle)
{
    uint16_t wordToSend;
    uint16_t wordReceived;
    uint8_t dummyData                = DSPI_GetDummyDataInstance(base);
    uint8_t *txData                  = handle->txData;
    uint8_t *rxData                  = handle->rxData;
    size_t remainingReceiveByteCount = handle->remainingReceiveByteCount;
    size_t remainingSendByteCount    = handle->remainingSendByteCount;

    while (remainingSendByteCount > 0U)
    {
        while (0U == (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoFillRequestFlag))
        {
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
        }
        if (txData != NULL)
        {
            wordToSend = *(txData);
            ++txData;

            if (remainingSendByteCount >= 2U)
            {
                wordToSend |= (uint16_t)(*(txData)) << 8U;
                ++txData;
            }
        }
        else
        {
            wordToSend = dummyData;
        }

        if (remainingSendByteCount <= 2U)
        {
            base->PUSHR = handle->lastCommand | wordToSend;

            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
            remainingSendByteCount = 0;

            while (remainingReceiveByteCount > 0U)
            {
                if ((uint32_t)kDSPI_RxFifoDrainRequestFlag ==
                    (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_RxFifoDrainRequestFlag))
                {
                    wordReceived = (uint16_t)DSPI_ReadData(base);

                    if (remainingReceiveByteCount != 1U)
                    {
                        if (rxData != NULL)
                        {
                            *(rxData) = (uint8_t)wordReceived;
                            ++rxData;
                            *(rxData) = (uint8_t)(wordReceived >> 8U);
                            ++rxData;
                        }
                        remainingReceiveByteCount -= 2U;
                    }
                    else
                    {
                        if (rxData != NULL)
                        {
                            *(rxData) = (uint8_t)wordReceived;
                            ++rxData;
                        }
                        remainingReceiveByteCount--;
                    }
                    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_RxFifoDrainRequestFlag);
                }
            }
        }
        else
        {
            base->PUSHR = handle->command | wordToSend;

            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);
            remainingSendByteCount -= 2U;

            while (((remainingReceiveByteCount - remainingSendByteCount) / 2U) >= handle->fifoSize)
            {
                if ((uint32_t)kDSPI_RxFifoDrainRequestFlag ==
                    (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_RxFifoDrainRequestFlag))
                {
                    wordReceived = (uint16_t)DSPI_ReadData(base);

                    if (rxData != NULL)
                    {
                        *rxData = (uint8_t)wordReceived;
                        ++rxData;
                        *rxData = (uint8_t)(wordReceived >> 8U);
                        ++rxData;
                    }
                    remainingReceiveByteCount -= 2U;

                    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_RxFifoDrainRequestFlag);
                }
            }
        }
    }
}

/*!
 * brief DSPI master transfer data using polling.
 *
 * This function transfers data using polling. This is a blocking function, which does not return until all transfers
 * have been completed.
 *
 * param base DSPI peripheral base address.
 * param transfer Pointer to the dspi_transfer_t structure.
 * return status of status_t.
 */
status_t DSPI_MasterTransferBlocking(SPI_Type *base, dspi_transfer_t *transfer)
{
    assert(NULL != transfer);

    if (transfer->dataSize == 0U)
    {
        return kStatus_InvalidArgument;
    }

    dspi_master_handle_t temphandle;
    DSPI_MasterTransferPrepare(base, &temphandle, transfer);

    DSPI_StartTransfer(base);

    if (temphandle.bitsPerFrame <= 8U)
    {
        DSPI_MasterHandleTransferByte(base, &temphandle);
    }
    else
    {
        DSPI_MasterHandleTransferHalfword(base, &temphandle);
    }

    return kStatus_Success;
}

static void DSPI_MasterTransferPrepare(SPI_Type *base, dspi_master_handle_t *handle, dspi_transfer_t *transfer)
{
    assert(NULL != handle);
    assert(NULL != transfer);

    uint32_t tmpMCR                          = 0;
    dspi_command_data_config_t commandStruct = {false, (uint8_t)kDSPI_Ctar0, (uint8_t)kDSPI_Pcs0, false, false};

    DSPI_StopTransfer(base);
    DSPI_DisableInterrupts(base, (uint32_t)kDSPI_AllInterruptEnable);
    DSPI_FlushFifo(base, true, true);
    DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_AllStatusFlag);

